{
    "tweet_id": "1894459072193196361",
    "proposal_title": "[TEMP CHECK] Deploy Aave on Soneium",
    "space_id": "aave.eth",
    "proposal_description": "## [TEMP CHECK] Deploy Aave on Soneium\n\n## Author: Mingshi S.\n\n## Date: 2025-02-10\n\n## Summary\n\nThis Temperature Check advocates for the deployment of Aave on [Soneium](https://soneium.org/), an Ethereum L2 developed by Sony Block Solutions Labs (a joint venture between [Sony Group Corporation](https://www.sony.com/en/) and [Startale Group](https://startale.com/en)). The proposal aims to provide general background information to gauge the community’s interest in the opportunity to deploy Aave V3 on Soneium.\n\n**This deployment proposal is an opportunity to tap into a consumer-focused Ethereum L2 and utilize Sony’s distribution channels and access to real-world consumers.** Built with OP Stack, Soneium offers a scalable, low-cost, and highly interoperable infrastructure for DeFi protocols. The deployment would integrate Aave into an Ethereum L2 designed for mainstream adoption, potentially tapping into Sony’s user base and an upcoming dynamic ecosystem of DeFi, gaming, NFTs, RWAs, and entertainment applications.\n\nThe proposal includes an ecosystem-wide liquidity incentive campaign, targeting a 7-figure USD commitment (100,000,000 [ASTR](https://coinmarketcap.com/currencies/astar/)) to support DeFi protocols, including Aave, to bootstrap liquidity on Soneium. Soneium is also willing to integrate and increase the adoption of GHO stablecoin in its ecosystem, especially for future real-world-focused use cases.\n\n## Motivation\n\n\"Empowering individuals and communities to collaborate, create, and fill the world with emotion together.\"\n\nSony Block Solution Labs believes that the development of [a comprehensive Web3 solution](https://www.sony.com/en/SonyInfo/News/Press/202501/25-002E/) based on blockchain technology has big potential for the company, which has developed a wide variety of businesses as part of its purpose to \"fill the world with emotion, through the power of creativity and technology\".\n\nSoneium launched its mainnet on January 14, 2025, settled 10M+ on-chain transactions with 2M+ unique wallet addresses as shown on [Blockscout](https://soneium.blockscout.com/), and achieved $45M+ total value secured according to [L2Beat](https://l2beat.com/scaling/projects/soneium), within 3 weeks. Soneium has also launched the Soneium Spark Incubation Program, attracting over 1,700 builders and projects. The participating Sony Group Companies include Sony Group, Sony Music, Sony Pictures, Sony Innovation Fund, Inzone, and Sony Global Education. Please refer to [here](https://x.com/soneium/status/1845766611677900923) for the list of winners of the first Soneium Spark.\n\nWe see DeFi as the backbone of blockchain adoption and is built with a vibrant DeFi ecosystem that promises to be both innovative and robust, featuring a well-rounded mix of multichain and native protocols. Notable names including Uniswap v4, Velodrome, QuickSwap, Stargate, Squid, Lido, Mellow, StakeStone, KelpDAO, Solv, OpenEden, etc. Our Soneium Spark program also incubated several standout projects that will be launching as native DeFi protocols on Soenium, bringing unique features and services to our users, including Kyo Finance (AMM), SoneX (AMM), SuperVol (On-chain Options), WaveX (Perpetuals), Macaron Finance (Leveraged Farming), etc.\n\nIn addition to the existing Web3 services, the Soneium team has been investigating how new services that collaborate with businesses within the Sony Group can be developed as Soneium-compatible apps. Specifically, we will explore protecting the rights of content created by creators, new mechanisms for distributing profits to support creators and fans, and opportunities for creators to be active across the digital and real worlds.\n\nFurthermore, by utilizing Web3 services, such as the Japan-regulated crypto exchange operated by Sony Group's S.BLOX Inc., and adding new value to the various businesses and utilizing IPs,, we aim to create apps that can be used daily by people who have never had the opportunity to experience Web3, and to build a world where Web3 services permeate people's daily lives.\n\n### Reasons for Integration:\n\n* **Potential to tap into the existing users from the [Sony ecosystem](https://www.sony.com/en/SonyInfo/products/) and further expand Aave user base with Soneium’s distribution networks and go mainstream together.** Soneium settled 10M+ on-chain transactions with 2M+ unique wallet addresses and achieved $45M+ total value secured within 3 weeks after launch.\n* **Establish Aave’s position as the major liquidity market and early mover on Soneium** and capture a rapidly growing market in the ecosystem with a focus on real-world adoption (e.g. JPY-USD carry trade on-chain to explore, etc.)\n  * We envision Soneium to be one of the most unique ecosystems in the crypto world that truly foster Web3 mainstream adoption utilising Sony’s distribution channels and business opportunities. We see Aave as an important and reliable partner to facilitate users’ demand in lending, borrowing, leveraging, and earning passive income.\n * Integrate closely with Soneium’s rapidly growing DeFi ecosystem, including strategic integrations with top-tier dApps like Uniswap, Velodrome, QuickSwap, Stargate, Squid, Lido, StakeStone, Mellow, Solv, OpenEden, etc. **Soneium has been in the first batch of blockchains for Uniswap v4 deployment with Uniswap frontend supported by Uniswap Labs.**\n* Operates in a high throughput, tps, and low gas fees environment based on OP Stack to provide a smooth UX and efficient lending experience. **Soneium is also equipped with top-tier infrastructures including Chainlink, Pyth, RedStone, LayerZero, Axelar, Superbridge, Across, Hyperlane, Li.Fi, Jumper Exchange, The Graph, etc.**\n* **Receive liquidity incentives for Aave depositors in any upcoming ecosystem-wide liquidity incentive campaign on Soneium from now to the future** and help Aave bootstrap liquidity on Soneium.\n  * We have been working on a 100M-[ASTR](https://coinmarketcap.com/currencies/astar/) (worth of $4M now) liquidity incentive campaign for mainnet launch at the moment as a starter, which can include Aave if Aave's deployment timeline aligns. More details can be found [here](https://forum.astar.network/t/treasury-proposal-for-acs-campaign/7806).\n\n## Technical Feasibility\n\n1. Seamless Integration and Compatibility with v3:\n\n  * Soneium is an EVM-equivalent Ethereum L2 built using OP Stack, which means Ethereum smart contracts are fully compatible.\n\n2. Chainlink Integration:\n\n  * Chainlink has deployed Chainlink Data Feeds and Chainlink Data Streams on Soneium, supporting a wide variety of assets including BTC, ETH, wstETH, USDC, etc.\n\n3. The Graph Integration:\n\n  * The Graph has integrated with Soneium and has Full Protocol Support for data indexing on Soenum.\n\n4. Development and Testing\n\n  * Startale Group will assist Aave’s technical team through its Integration and Support team to ensure a smooth integration.\n\n5. Security Audits:\n\n  * Startale Group will cooperate with the Aave DAO in order to run audits to ensure that the deployment meets all security requirements, should this be requested by the DAO.\n\n## Deployment Plan\n\n1. Phase 1: Initial Discussion\n\n  * Gather community feedback through this TEMP CHECK.\n\n2. Phase 2: Detailed Proposal\n\n  * If the TEMP CHECK indicates positive support, submit a detailed ARFC (Aave Request for Comment) outlining the technical, economic, and security aspects of the integration.\n\n3. Phase 3: Implementation and Monitoring\n\n  * Upon eventual approval, deploy Aave V3 on Soneium and monitor the integration closely to address any issues and ensure stability.\n\n## Risks and Mitigations:\n\n1. Technical Challenges:\n\n  * Startale Group will work closely with Aave’s developers and service providers to address any technical challenges during integration.\n\n2. Security Risks:\n\n  * We are open to conducting security and risk audits to identify and mitigate potential risks associated with this proposal and deployment. Startale Group will be available to address raised concerns, and support these potential audits.\n\n3. Community Adoption:\n\n  * Soneium and Astar will activate its community to engage with the Aave community ensuring support and adoption. Also it will work aligned with the Aave community to engage and attract users to Soneium.\n\n## Call to Action:\n\nWe invite the Aave community to express their support or concerns regarding this TEMP CHECK. Your feedback is crucial in determining whether to proceed with a detailed ARFC for the Aave V3 deployment on Soneium, and will help us ensure that the integration aligns with Aave’s goals and community interests.\n\n## Useful Links:\n\nSoneium Website: https://soneium.org/\n\nSoneium L2Beat: https://l2beat.com/scaling/projects/soneium\n\nSoneium Blockscout: https://soneium.blockscout.com/\n\nSoneium Defillama: https://defillama.com/chain/Soneium\n\nSony Block Solution Labs Website: https://www.sonynetwork.co.jp/sonynetworkcomlabs/en/\n\nSony Web3 Solution: [Launch of a comprehensive blockchain-centric Web3 solution](https://www.sony.com/en/SonyInfo/News/Press/202501/25-002E/)\n\nStartale Group Website: https://startale.com/en\n\nACS Liquidity Incentive Campaign: https://forum.astar.network/t/treasury-proposal-for-acs-campaign/7806\n\nAave Documentation: https://aave.com/docs\n\n## Next Steps\n\n1. Publication of TEMP CHECK, collect community & service providers feedback before escalating proposal to TEMP CHECK snapshot stage.\n2. If the TEMP CHECK snapshot outcome is YAE, publish an ARFC to continue gathering community and Service Providers feedback.\n3. If the ARFC snapshot outcome is YAE, publish an AIP vote for final confirmation and enforcement of the proposal.\n\n## Copyright\n\nThanks to @ACI for TEMP CHECK references in the forum.\nCopyright and related rights waived under [CC0](https://creativecommons.org/publicdomain/zero/1.0/).",
    "dao_name": "Aave"
}